Dataset/data_test/swarm-sn-wrk-mixed-c6525-25g-exp12-havail0-hori1-verti1-infi1-client1-t8-c512-d30-R6000-N1
Using argument nginx
using  args: threads=8 and connections=512 and duration=30 and requests=6000
Running 30s test @ http://localhost:8080
  8 threads and 512 connections
  Thread calibration: mean lat.: 2470.394ms, rate sampling interval: 10379ms
  Thread calibration: mean lat.: 2882.017ms, rate sampling interval: 10813ms
  Thread calibration: mean lat.: 2800.093ms, rate sampling interval: 10387ms
  Thread calibration: mean lat.: 3037.445ms, rate sampling interval: 11149ms
  Thread calibration: mean lat.: 2965.811ms, rate sampling interval: 10551ms
  Thread calibration: mean lat.: 2563.462ms, rate sampling interval: 11059ms
  Thread calibration: mean lat.: 2541.351ms, rate sampling interval: 9125ms
  Thread calibration: mean lat.: 2594.874ms, rate sampling interval: 9707ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    13.99s     5.99s   26.05s    62.95%
    Req/Sec   160.50     11.17   175.00     70.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   13.35s 
 75.000%   17.91s 
 90.000%   23.76s 
 99.000%   26.05s 
 99.900%   27.95s 
 99.990%   28.41s 
 99.999%   28.48s 
100.000%   28.48s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

     903.679     0.000000            1         1.00
    6406.143     0.100000         2556         1.11
    8200.191     0.200000         5102         1.25
   10174.463     0.300000         7653         1.43
   12148.735     0.400000        10204         1.67
   13352.959     0.500000        12766         2.00
   14114.815     0.550000        14032         2.22
   15220.735     0.600000        15309         2.50
   16105.471     0.650000        16583         2.86
   16990.207     0.700000        17868         3.33
   17907.711     0.750000        19132         4.00
   18546.687     0.775000        19770         4.44
   19382.271     0.800000        20414         5.00
   20168.703     0.825000        21056         5.71
   20774.911     0.850000        21684         6.67
   21954.559     0.875000        22319         8.00
   23134.207     0.887500        22641         8.89
   23756.799     0.900000        22969        10.00
   24133.631     0.912500        23279        11.43
   24461.311     0.925000        23607        13.33
   24707.071     0.937500        23924        16.00
   24838.143     0.943750        24087        17.78
   24969.215     0.950000        24240        20.00
   25083.903     0.956250        24409        22.86
   25214.975     0.962500        24563        26.67
   25378.815     0.968750        24713        32.00
   25460.735     0.971875        24794        35.56
   25542.655     0.975000        24876        40.00
   25640.959     0.978125        24962        45.71
   25722.879     0.981250        25030        53.33
   25821.183     0.984375        25120        64.00
   25870.335     0.985938        25153        71.11
   25919.487     0.987500        25190        80.00
   26001.407     0.989062        25238        91.43
   26083.327     0.990625        25268       106.67
   26296.319     0.992188        25309       128.00
   26427.391     0.992969        25329       142.22
   26525.695     0.993750        25348       160.00
   26722.303     0.994531        25368       182.86
   26869.759     0.995313        25390       213.33
   27000.831     0.996094        25409       256.00
   27279.359     0.996484        25418       284.44
   27377.663     0.996875        25428       320.00
   27492.351     0.997266        25439       365.71
   27607.039     0.997656        25448       426.67
   27738.111     0.998047        25459       512.00
   27820.031     0.998242        25465       568.89
   27869.183     0.998437        25471       640.00
   27901.951     0.998633        25473       731.43
   27934.719     0.998828        25478       853.33
   27967.487     0.999023        25483      1024.00
   28098.559     0.999121        25485      1137.78
   28180.479     0.999219        25490      1280.00
   28180.479     0.999316        25490      1462.86
   28213.247     0.999414        25495      1706.67
   28213.247     0.999512        25495      2048.00
   28229.631     0.999561        25496      2275.56
   28278.783     0.999609        25498      2560.00
   28295.167     0.999658        25500      2925.71
   28295.167     0.999707        25500      3413.33
   28360.703     0.999756        25502      4096.00
   28360.703     0.999780        25502      4551.11
   28409.855     0.999805        25504      5120.00
   28409.855     0.999829        25504      5851.43
   28409.855     0.999854        25504      6826.67
   28409.855     0.999878        25504      8192.00
   28459.007     0.999890        25505      9102.22
   28459.007     0.999902        25505     10240.00
   28459.007     0.999915        25505     11702.86
   28475.391     0.999927        25507     13653.33
   28475.391     1.000000        25507          inf
#[Mean    =    13989.597, StdDeviation   =     5986.819]
#[Max     =    28459.008, Total count    =        25507]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  38151 requests in 30.00s, 339.46MB read
  Non-2xx or 3xx responses: 570
Requests/sec:   1271.72
Transfer/sec:     11.32MB